lkolbly/cmsis-svd/data/TexasInstruments/LM3S9B95.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="CAN0">
      <name>CAN1</name>
      <prependToName>CAN1</prependToName>
      <baseAddress>0x40041000</baseAddress>
    </peripheral>
    <peripheral>
      <name>MAC</name>
      <description>Register map for MAC peripheral</description>
      <groupName>MAC</groupName>
      <prependToName>MAC</prependToName>
      <baseAddress>0x40048000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>RIS</name>
          <description>Ethernet MAC Raw Interrupt Status/Acknowledge</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>MAC_RIS_RXINT</name>
              <description>Packet Received</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>MAC_RIS_TXER</name>
              <description>Transmit Error</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>MAC_RIS_TXEMP</name>
              <description>Transmit FIFO Empty</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>MAC_RIS_FOV</name>
              <description>FIFO Overrun</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>MAC_RIS_RXER</name>
              <description>Receive Error</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>MAC_RIS_MDINT</name>
              <description>MII Transaction Complete</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>MAC_RIS_PHYINT</name>
              <description>PHY Interrupt</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <description>Ethernet MAC Interrupt Mask</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>MAC_IM_RXINTM</name>
              <description>Mask Packet Received</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>MAC_IM_TXERM</name>
              <description>Mask Transmit Error</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>MAC_IM_TXEMPM</name>
              <description>Mask Transmit FIFO Empty</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>MAC_IM_FOVM</name>
              <description>Mask FIFO Overrun</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>MAC_IM_RXERM</name>
              <description>Mask Receive Error</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>MAC_IM_MDINTM</name>
              <description>Mask MII Transaction Complete</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>MAC_IM_PHYINTM</name>
              <description>Mask PHY Interrupt</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCTL</name>
          <description>Ethernet MAC Receive Control</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>MAC_RCTL_RXEN</name>
              <description>Enable Receiver</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>MAC_RCTL_AMUL</name>
              <description>Enable Multicast Frames</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>MAC_RCTL_PRMS</name>
              <description>Enable Promiscuous Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>MAC_RCTL_BADCRC</name>
              <description>Enable Reject Bad CRC</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>MAC_RCTL_RSTFIFO</name>
              <description>Clear Receive FIFO</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TCTL</name>
          <description>Ethernet MAC Transmit Control</description>
          <addressOffset>0x0000000C</addressOffset>
          <fields>
            <field>
              <name>MAC_TCTL_TXEN</name>
              <description>Enable Transmitter</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>MAC_TCTL_PADEN</name>
              <description>Enable Packet Padding</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>MAC_TCTL_CRC</name>
              <description>Enable CRC Generation</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>MAC_TCTL_DUPLEX</name>
              <description>Enable Duplex Mode</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA</name>
          <description>Ethernet MAC Data</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>MAC_DATA_RXDATA</name>
              <description>Receive FIFO Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA</name>
          <description>Ethernet MAC Data</description>
          <alternateGroup>MAC_ALT</alternateGroup>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>MAC_DATA_TXDATA</name>
              <description>Transmit FIFO Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IA0</name>
          <description>Ethernet MAC Individual Address 0</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>MAC_IA0_MACOCT1</name>
              <description>MAC Address Octet 1</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>MAC_IA0_MACOCT2</name>
              <description>MAC Address Octet 2</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>MAC_IA0_MACOCT3</name>
              <description>MAC Address Octet 3</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>MAC_IA0_MACOCT4</name>
              <description>MAC Address Octet 4</description>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IA1</name>
          <description>Ethernet MAC Individual Address 1</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>MAC_IA1_MACOCT5</name>
              <description>MAC Address Octet 5</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>MAC_IA1_MACOCT6</name>
              <description>MAC Address Octet 6</description>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>THR</name>
          <description>Ethernet MAC Threshold</description>
          <addressOffset>0x0000001C</addressOffset>
          <fields>
            <field>
              <name>MAC_THR_THRESH</name>
              <description>Threshold Value</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MCTL</name>
          <description>Ethernet MAC Management Control</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>MAC_MCTL_START</name>
              <description>MII Register Transaction Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>MAC_MCTL_WRITE</name>
              <description>MII Register Transaction Type</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>MAC_MCTL_REGADR</name>
              <description>MII Register Address</description>
              <bitRange>[7:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MDV</name>
          <description>Ethernet MAC Management Divider</description>
          <addressOffset>0x00000024</addressOffset>
          <fields>
            <field>
              <name>MAC_MDV_DIV</name>
              <description>Clock Divider</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MTXD</name>
          <description>Ethernet MAC Management Transmit Data</description>
          <addressOffset>0x0000002C</addressOffset>
          <fields>
            <field>
              <name>MAC_MTXD_MDTX</name>
              <description>MII Register Transmit Data</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MRXD</name>
          <description>Ethernet MAC Management Receive Data</description>
          <addressOffset>0x00000030</addressOffset>
          <fields>
            <field>
              <name>MAC_MRXD_MDRX</name>
              <description>MII Register Receive Data</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NP</name>
          <description>Ethernet MAC Number of Packets</description>
          <addressOffset>0x00000034</addressOffset>
          <fields>
            <field>
              <name>MAC_NP_NPR</name>
              <description>Number of Packets in Receive FIFO</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TR</name>
          <description>Ethernet MAC Transmission Request</description>
          <addressOffset>0x00000038</addressOffset>
          <fields>
            <field>
              <name>MAC_TR_NEWTX</name>
              <description>New Transmission</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TS</name>
          <description>Ethernet MAC Timer Support</description>
          <addressOffset>0x0000003C</addressOffset>
          <fields>
            <field>
              <name>MAC_TS_TSEN</name>
              <description>Time Stamp Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LED</name>
          <description>Ethernet MAC LED Encoding</description>
          <addressOffset>0x00000040</addressOffset>
          <fields>
            <field>
              <name>MAC_LED_LED0</name>
              <description>LED0 Source</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAC_LED_LED0_LINK</name>
                  <description>Link OK (Default LED0)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAC_LED_LED0_RXTX</name>
                  <description>RX or TX Activity</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAC_LED_LED0_100</name>
                  <description>100BASE-TX mode</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAC_LED_LED0_10</name>
                  <description>10BASE-T mode</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAC_LED_LED0_DUPLEX</name>
                  <description>Full-Duplex</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAC_LED_LED0_LINKACT</name>
                  <description>Link OK &amp; Blink=RX or TX Activity</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAC_LED_LED1</name>
              <description>LED1 Source</description>
              <bitRange>[11:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAC_LED_LED1_LINK</name>
                  <description>Link OK</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAC_LED_LED1_RXTX</name>
                  <description>RX or TX Activity (Default LED1)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAC_LED_LED1_100</name>
                  <description>100BASE-TX mode</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAC_LED_LED1_10</name>
                  <description>10BASE-T mode</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAC_LED_LED1_DUPLEX</name>
                  <description>Full-Duplex</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAC_LED_LED1_LINKACT</name>
                  <description>Link OK &amp; Blink=RX or TX Activity</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MDIX</name>
          <description>Ethernet PHY MDIX</description>
          <addressOffset>0x00000044</addressOffset>
          <fields>
            <field>
              <name>MAC_MDIX_EN</name>
              <description>MDI/MDI-X Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
