lkolbly/cmsis-svd/data/TexasInstruments/LM3S9B95.svd
        <register>
          <name>HB16CFG2</name>
          <description>EPI Host-Bus 16 Configuration 2</description>
          <alternateGroup>EPI_ALT16</alternateGroup>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>EPI_HB16CFG2_CSCFG</name>
              <description>Chip Select Configuration</description>
              <bitRange>[25:24]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_CSCFG_ALE</name>
                  <description>ALE Configuration</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_CSCFG_CS</name>
                  <description>CSn Configuration</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_CSCFG_DCS</name>
                  <description>Dual CSn Configuration</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_CSCFG_ADCS</name>
                  <description>ALE with Dual CSn Configuration</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16CFG2_CSBAUD</name>
              <description>Chip Select Baud Rate</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG2_WORD</name>
              <description>Word Access Mode</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GPCFG2</name>
          <description>EPI General-Purpose Configuration 2</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>EPI_GPCFG2_WORD</name>
              <description>Word Access Mode</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDRMAP</name>
          <description>EPI Address Map</description>
          <addressOffset>0x0000001C</addressOffset>
          <fields>
            <field>
              <name>EPI_ADDRMAP_ERADR</name>
              <description>External RAM Address</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ERADR_NONE</name>
                  <description>Not mapped</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ERADR_6000</name>
                  <description>At 0x6000.0000</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ERADR_8000</name>
                  <description>At 0x8000.0000</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_ADDRMAP_ERSZ</name>
              <description>External RAM Size</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ERSZ_256B</name>
                  <description>256 bytes; lower address range: 0x00 to 0xFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ERSZ_64KB</name>
                  <description>64 KB; lower address range: 0x0000 to 0xFFFF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ERSZ_16MB</name>
                  <description>16 MB; lower address range: 0x00.0000 to 0xFF.FFFF</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ERSZ_256MB</name>
                  <description>256 MB; lower address range: 0x000.0000 to 0xFFF.FFFF</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_ADDRMAP_EPADR</name>
              <description>External Peripheral Address</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_EPADR_NONE</name>
                  <description>Not mapped</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_EPADR_A000</name>
                  <description>At 0xA000.0000</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_EPADR_C000</name>
                  <description>At 0xC000.0000</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_ADDRMAP_EPSZ</name>
              <description>External Peripheral Size</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_EPSZ_256B</name>
                  <description>256 bytes; lower address range: 0x00 to 0xFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_EPSZ_64KB</name>
                  <description>64 KB; lower address range: 0x0000 to 0xFFFF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_EPSZ_16MB</name>
                  <description>16 MB; lower address range: 0x00.0000 to 0xFF.FFFF</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_EPSZ_256MB</name>
                  <description>256 MB; lower address range: 0x000.0000 to 0xFFF.FFFF</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RSIZE0</name>
          <description>EPI Read Size 0</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>EPI_RSIZE0_SIZE</name>
              <description>Current Size</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_RSIZE0_SIZE_8BIT</name>
                  <description>Byte (8 bits)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_RSIZE0_SIZE_16BIT</name>
                  <description>Half-word (16 bits)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_RSIZE0_SIZE_32BIT</name>
                  <description>Word (32 bits)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RADDR0</name>
          <description>EPI Read Address 0</description>
          <addressOffset>0x00000024</addressOffset>
          <fields>
            <field>
              <name>EPI_RADDR0_ADDR</name>
              <description>Current Address</description>
              <bitRange>[28:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RPSTD0</name>
          <description>EPI Non-Blocking Read Data 0</description>
          <addressOffset>0x00000028</addressOffset>
          <fields>
            <field>
              <name>EPI_RPSTD0_POSTCNT</name>
              <description>Post Count</description>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RSIZE1</name>
          <description>EPI Read Size 1</description>
          <addressOffset>0x00000030</addressOffset>
          <fields>
            <field>
              <name>EPI_RSIZE1_SIZE</name>
              <description>Current Size</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_RSIZE1_SIZE_8BIT</name>
                  <description>Byte (8 bits)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_RSIZE1_SIZE_16BIT</name>
                  <description>Half-word (16 bits)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_RSIZE1_SIZE_32BIT</name>
                  <description>Word (32 bits)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RADDR1</name>
          <description>EPI Read Address 1</description>
          <addressOffset>0x00000034</addressOffset>
          <fields>
            <field>
              <name>EPI_RADDR1_ADDR</name>
              <description>Current Address</description>
              <bitRange>[28:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RPSTD1</name>
          <description>EPI Non-Blocking Read Data 1</description>
          <addressOffset>0x00000038</addressOffset>
          <fields>
            <field>
              <name>EPI_RPSTD1_POSTCNT</name>
              <description>Post Count</description>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <description>EPI Status</description>
          <addressOffset>0x00000060</addressOffset>
          <fields>
            <field>
              <name>EPI_STAT_ACTIVE</name>
              <description>Register Active</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPI_STAT_NBRBUSY</name>
              <description>Non-Blocking Read Busy</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EPI_STAT_WBUSY</name>
              <description>Write Busy</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EPI_STAT_INITSEQ</name>
              <description>Initialization Sequence</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EPI_STAT_XFEMPTY</name>
              <description>External FIFO Empty</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EPI_STAT_XFFULL</name>
              <description>External FIFO Full</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EPI_STAT_CELOW</name>
              <description>Clock Enable Low</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RFIFOCNT</name>
          <description>EPI Read FIFO Count</description>
          <addressOffset>0x0000006C</addressOffset>
          <fields>
            <field>
              <name>EPI_RFIFOCNT_COUNT</name>
              <description>FIFO Count</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO</name>
          <description>EPI Read FIFO</description>
          <addressOffset>0x00000070</addressOffset>
          <fields>
            <field>
              <name>EPI_READFIFO_DATA</name>
              <description>Reads Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO1</name>
          <description>EPI Read FIFO Alias 1</description>
          <addressOffset>0x00000074</addressOffset>
          <fields>
            <field>
              <name>EPI_READFIFO1_DATA</name>
              <description>Reads Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO2</name>
          <description>EPI Read FIFO Alias 2</description>
          <addressOffset>0x00000078</addressOffset>
          <fields>
            <field>
              <name>EPI_READFIFO2_DATA</name>
              <description>Reads Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO3</name>
          <description>EPI Read FIFO Alias 3</description>
          <addressOffset>0x0000007C</addressOffset>
          <fields>
            <field>
              <name>EPI_READFIFO3_DATA</name>
              <description>Reads Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO4</name>
          <description>EPI Read FIFO Alias 4</description>
          <addressOffset>0x00000080</addressOffset>
          <fields>
            <field>
              <name>EPI_READFIFO4_DATA</name>
              <description>Reads Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO5</name>
          <description>EPI Read FIFO Alias 5</description>
          <addressOffset>0x00000084</addressOffset>
          <fields>
            <field>
              <name>EPI_READFIFO5_DATA</name>
              <description>Reads Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO6</name>
          <description>EPI Read FIFO Alias 6</description>
          <addressOffset>0x00000088</addressOffset>
          <fields>
            <field>
              <name>EPI_READFIFO6_DATA</name>
              <description>Reads Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>READFIFO7</name>
          <description>EPI Read FIFO Alias 7</description>
          <addressOffset>0x0000008C</addressOffset>
          <fields>
            <field>
              <name>EPI_READFIFO7_DATA</name>
              <description>Reads Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFOLVL</name>
          <description>EPI FIFO Level Selects</description>
          <addressOffset>0x00000200</addressOffset>
          <fields>
            <field>
              <name>EPI_FIFOLVL_RDFIFO</name>
              <description>Read FIFO</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_RDFIFO_EMPT</name>
                  <description>Empty</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_RDFIFO_1_8</name>
                  <description>Trigger when there are 1 or more entries in the NBRFIFO</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_RDFIFO_1_4</name>
                  <description>Trigger when there are 2 or more entries in the NBRFIFO</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_RDFIFO_1_2</name>
                  <description>Trigger when there are 4 or more entries in the NBRFIFO</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_RDFIFO_3_4</name>
                  <description>Trigger when there are 6 or more entries in the NBRFIFO</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_RDFIFO_7_8</name>
                  <description>Trigger when there are 7 or more entries in the NBRFIFO</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_RDFIFO_FULL</name>
                  <description>Trigger when there are 8 entries in the NBRFIFO</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_FIFOLVL_WRFIFO</name>
              <description>Write FIFO</description>
              <bitRange>[6:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_WRFIFO_EMPT</name>
                  <description>Trigger when there are 1 to 4 spaces available in the WFIFO</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_WRFIFO_1_4</name>
                  <description>Trigger when there are 1 to 3 spaces available in the WFIFO</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_WRFIFO_1_2</name>
                  <description>Trigger when there are 1 to 2 spaces available in the WFIFO</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_FIFOLVL_WRFIFO_3_4</name>
                  <description>Trigger when there is 1 space available in the WFIFO</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_FIFOLVL_RSERR</name>
              <description>Read Stall Error</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EPI_FIFOLVL_WFERR</name>
              <description>Write Full Error</description>
              <bitRange>[17:17]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WFIFOCNT</name>
          <description>EPI Write FIFO Count</description>
          <addressOffset>0x00000204</addressOffset>
          <fields>
            <field>
              <name>EPI_WFIFOCNT_WTAV</name>
              <description>Available Write Transactions</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <description>EPI Interrupt Mask</description>
          <addressOffset>0x00000210</addressOffset>
          <fields>
            <field>
              <name>EPI_IM_ERRIM</name>
              <description>Error Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPI_IM_RDIM</name>
              <description>Read Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPI_IM_WRIM</name>
              <description>Write Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <description>EPI Raw Interrupt Status</description>
          <addressOffset>0x00000214</addressOffset>
          <fields>
            <field>
              <name>EPI_RIS_ERRRIS</name>
              <description>Error Raw Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPI_RIS_RDRIS</name>
              <description>Read Raw Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPI_RIS_WRRIS</name>
              <description>Write Raw Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <description>EPI Masked Interrupt Status</description>
          <addressOffset>0x00000218</addressOffset>
          <fields>
            <field>
              <name>EPI_MIS_ERRMIS</name>
              <description>Error Masked Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPI_MIS_RDMIS</name>
              <description>Read Masked Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPI_MIS_WRMIS</name>
              <description>Write Masked Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EISC</name>
          <description>EPI Error Interrupt Status and Clear</description>
          <addressOffset>0x0000021C</addressOffset>
          <fields>
            <field>
              <name>EPI_EISC_TOUT</name>
              <description>Timeout Error</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPI_EISC_RSTALL</name>
              <description>Read Stalled Error</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPI_EISC_WTFULL</name>
              <description>Write FIFO Full Error</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
